---
kind: method
id: M:Autodesk.Revit.DB.Macros.DocumentEntryPoint.OnShutdownEO
source: html/cc1b5aad-72ee-9e67-18f3-7ae2eb3be1f9.htm
---
# Autodesk.Revit.DB.Macros.DocumentEntryPoint.OnShutdownEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void OnShutdownEO()
```